Indemsys/Multizone-temperature-sensor/KW40_Firmware/Platform/FSL/fsl_clock_manager.c
  /* Send notification to all callback. */
  for (callbackIdx = 0; callbackIdx < g_clockState.callbackNum; callbackIdx++)
  {
    callbackConfig = g_clockState.callbackConfig[callbackIdx];
    if ((NULL != callbackConfig) &&
        ((uint8_t)callbackConfig->callbackType & (uint8_t)kClockManagerNotifyBefore))
    {
      if (kClockManagerSuccess !=
            (*callbackConfig->callback)(&notifyStruct,
                                        callbackConfig->callbackData))
      {
        g_clockState.errorCallbackIndex = callbackIdx;
        /* Save the error callback index. */
        ret = kClockManagerErrorNotificationBefore;

        if (kClockManagerPolicyAgreement == policy)
        {
          break;
        }
      }
    }
  }

  /* If all callback success or forceful policy is used. */
  if ((kClockManagerSuccess == ret) ||
      (policy == kClockManagerPolicyForcible))
  {
    /* clock mode switch. */
    OSA_EnterCritical(kCriticalDisableInt);
    CLOCK_SYS_SetConfiguration(g_clockState.configTable[targetConfigIndex]);

    g_clockState.curConfigIndex = targetConfigIndex;
    OSA_ExitCritical(kCriticalDisableInt);

    notifyStruct.notifyType = kClockManagerNotifyAfter;

    for (callbackIdx = 0; callbackIdx < g_clockState.callbackNum; callbackIdx++)
    {
      callbackConfig = g_clockState.callbackConfig[callbackIdx];
      if ((NULL != callbackConfig) &&
          ((uint8_t)callbackConfig->callbackType & (uint8_t)kClockManagerNotifyAfter))
      {
        if (kClockManagerSuccess !=
              (*callbackConfig->callback)(&notifyStruct,
                                          callbackConfig->callbackData))
        {
          g_clockState.errorCallbackIndex = callbackIdx;
          /* Save the error callback index. */
          ret = kClockManagerErrorNotificationAfter;

          if (kClockManagerPolicyAgreement == policy)
          {
            break;
          }
        }
      }
    }
  }
  else /* Error occurs, need to send "RECOVER" notification. */
  {
    notifyStruct.notifyType = kClockManagerNotifyRecover;
    while (callbackIdx--)
    {
      callbackConfig = g_clockState.callbackConfig[callbackIdx];
      if (NULL != callbackConfig)
      {
        (*callbackConfig->callback)(&notifyStruct,
                                    callbackConfig->callbackData);
      }
    }
  }

  OSA_ExitCritical(kCriticalLockSched);

  return ret;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetCurrentConfiguration
 * Description   : Get current clock configuration index.
 *
 *END**************************************************************************/
uint8_t CLOCK_SYS_GetCurrentConfiguration(void)
{
  return g_clockState.curConfigIndex;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetErrorCallback
 * Description   : Get the callback which returns error in last clock switch.
 *
 *END**************************************************************************/
clock_manager_callback_user_config_t* CLOCK_SYS_GetErrorCallback(void)
{
  /* If all callbacks return success. */
  if (g_clockState.errorCallbackIndex >= g_clockState.clockConfigNum)
  {
    return NULL;
  }
  else
  {
    return g_clockState.callbackConfig[g_clockState.errorCallbackIndex];
  }
}

#if (defined(FSL_FEATURE_SOC_SCG_COUNT) && FSL_FEATURE_SOC_SCG_COUNT)

#elif FSL_FEATURE_SOC_MCGLITE_COUNT
/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_SYS_SetMcgliteMode
 * Description  : Set MCG_Lite to some mode.
 * This function transitions the MCG_lite to some mode according to configuration
 * parameter.
 *
 *END***********************************************************************************/
mcglite_mode_error_t CLOCK_SYS_SetMcgliteMode(mcglite_config_t const *targetConfig)
{
  mcglite_mode_error_t ret = kMcgliteModeErrNone;

  assert(targetConfig->mcglite_mode < kMcgliteModeStop);

  /* MCG_LITE mode change. */
  switch (targetConfig->mcglite_mode)
  {
  case kMcgliteModeLirc8M:
  case kMcgliteModeLirc2M:
  case kMcgliteModeLirc:
    ret = CLOCK_HAL_SetLircMode(MCG,
                                targetConfig->ircs,
                                targetConfig->fcrdiv);
    break;
  case kMcgliteModeExt:
    ret = CLOCK_HAL_SetExtMode(MCG);
    break;
  default:
    ret = CLOCK_HAL_SetHircMode(MCG);
    break;
  }

  /* Set other registers. */
  if (kMcgliteModeErrNone == ret)
  {
    /* Enable HIRC when MCG_LITE is not in HIRC mode. */
    CLOCK_HAL_SetHircCmd(MCG, targetConfig->hircEnableInNotHircMode);

    /* Enable IRCLK. */
    CLOCK_HAL_SetLircCmd(MCG, targetConfig->irclkEnable);
    CLOCK_HAL_SetLircStopCmd(MCG, targetConfig->irclkEnableInStop);

    /* Set IRCS. */
    CLOCK_HAL_SetLircSelMode(MCG, targetConfig->ircs);

    /* Set LIRC_DIV2. */
    CLOCK_HAL_SetLircDiv2(MCG, targetConfig->lircDiv2);
  }

  return ret;
}
#else

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_SYS_FllStableDelay
 * Description  : Function to delay at list 1 ms to wait FLL stable.
 *
 *END***********************************************************************************/
static void CLOCK_SYS_FllStableDelay(void)
{
  uint32_t i = 30000U;
  while (i--)
  {
    __asm("nop");
  }
}

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_SYS_BootToFee
 * Description  : This function is used to set MCG to FEE mode when boot up.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_SYS_BootToFee(const mcg_config_t *config)
{
  mcg_mode_error_t    errorCode;

     #if FSL_FEATURE_MCG_USE_OSCSEL
  mcg_oscsel_select_t oscsel    = config->oscsel;
  #else
  mcg_oscsel_select_t oscsel    = kMcgOscselOsc;
  #endif

  // Set to PEE mode.
  #if (defined(FSL_FEATURE_MCG_RESET_IS_BLPI) && FSL_FEATURE_MCG_RESET_IS_BLPI)
  // If reset mode is BLPI, first disable LP to enter FBI mode.
  CLOCK_HAL_SetLowPowerModeCmd(MCG, false);
  #endif
  errorCode = CLOCK_HAL_SetFeeMode(MCG, oscsel, config->frdiv,
                                   config->dmx32, config->drs,
                                   CLOCK_SYS_FllStableDelay);

  if (kMcgModeErrNone == errorCode)
  {
    return errorCode;
  }

  #if FSL_FEATURE_MCG_HAS_PLL
  // Check if need to enable PLL.
  if (config->pll0EnableInFllMode)
  {
      #if (FSL_FEATURE_MCG_HAS_PLL_PRDIV && FSL_FEATURE_MCG_HAS_PLL_VDIV)
    CLOCK_HAL_EnablePll0InFllMode(MCG, config->prdiv0, config->vdiv0, config->pll0EnableInFllMode);
      #else
    CLOCK_HAL_EnablePll0InFllMode(MCG, config->pll0EnableInFllMode);
      #endif
  }

    #if FSL_FEATURE_MCG_HAS_PLL1
  // Check if need to enable PLL1.
  if (config->pll1EnableInFllMode)
  {
    CLOCK_HAL_EnablePll1InFllMode(MCG, config->prdiv1, config->vdiv1, config->pll1EnableInFllMode);
  }
    #endif
  #endif

  // Set MCGIRCLK.
  if (config->irclkEnable)
  {
    CLOCK_HAL_UpdateInternalRefClk(MCG,
                                   config->ircs,
                                   config->fcrdiv,
                                   config->irclkEnableInStop);
  }

  return errorCode;
}

