Indemsys/Multizone-temperature-sensor/KW40_Firmware/Platform/FSL/fsl_clock_manager.c
/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_SYS_BootToFei
 * Description  : This function is used to set MCG to FEI mode when boot up.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_SYS_BootToFei(const mcg_config_t *config)
{
  mcg_mode_error_t errorCode;

  #if (defined(FSL_FEATURE_MCG_RESET_IS_BLPI) && FSL_FEATURE_MCG_RESET_IS_BLPI)
  // If reset mode is BLPI, first disable LP to enter FBI mode.
  CLOCK_HAL_SetLowPowerModeCmd(MCG, false);
  #endif
  // Set to FEI mode.
  errorCode = CLOCK_HAL_SetFeiMode(MCG, config->drs, CLOCK_SYS_FllStableDelay);

  if (kMcgModeErrNone == errorCode)
  {
    return errorCode;
  }

  #if FSL_FEATURE_MCG_HAS_PLL
  // Check if need to enable PLL.
  if (config->pll0EnableInFllMode)
  {
      #if (FSL_FEATURE_MCG_HAS_PLL_PRDIV && FSL_FEATURE_MCG_HAS_PLL_VDIV)
    CLOCK_HAL_EnablePll0InFllMode(MCG, config->prdiv0, config->vdiv0, config->pll0EnableInFllMode);
      #else
    CLOCK_HAL_EnablePll0InFllMode(MCG, config->pll0EnableInFllMode);
      #endif
  }

    #if FSL_FEATURE_MCG_HAS_PLL1
  // Check if need to enable PLL1.
  if (config->pll1EnableInFllMode)
  {
    CLOCK_HAL_EnablePll1InFllMode(MCG, config->prdiv1, config->vdiv1, config->pll1EnableInFllMode);
  }
    #endif
  #endif

  // Set MCGIRCLK.
  if (config->irclkEnable)
  {
    CLOCK_HAL_UpdateInternalRefClk(MCG,
                                   config->ircs,
                                   config->fcrdiv,
                                   config->irclkEnableInStop);
  }

  return errorCode;
}

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_SYS_BootToBlpi
 * Description  : This function is used to set MCG to BLPI mode when boot up.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_SYS_BootToBlpi(const mcg_config_t *config)
{
  mcg_mode_error_t errorCode;

  #if !(defined(FSL_FEATURE_MCG_RESET_IS_BLPI) && FSL_FEATURE_MCG_RESET_IS_BLPI)
  /* Set MCG_C1[CLKS] to change to FBI mode. */
  CLOCK_HAL_SetClkOutSrc(MCG, kMcgClkOutSrcInternal);
  while (CLOCK_HAL_GetClkOutStat(MCG) != kMcgClkOutStatInternal)
  {
  }
  #endif

  /* Change to Blpi mode. */
  errorCode = CLOCK_HAL_SetBlpiMode(MCG, config->fcrdiv, config->ircs);

  if (kMcgModeErrNone == errorCode)
  {
    /* Enable or disalbe IRCLK output. */
    CLOCK_HAL_SetInternalRefClkEnableCmd(MCG, config->irclkEnable);
    CLOCK_HAL_SetInternalRefClkEnableInStopCmd(MCG, config->irclkEnableInStop);
  }

  return errorCode;
}

/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_SYS_BootToBlpe
 * Description  : This function is used to set MCG to BLPE mode when boot up.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_SYS_BootToBlpe(const mcg_config_t *config)
{
  #if (defined(FSL_FEATURE_MCG_RESET_IS_BLPI) && FSL_FEATURE_MCG_RESET_IS_BLPI)
  // If reset mode is BLPI, first disable LP to enter FBI mode.
  CLOCK_HAL_SetLowPowerModeCmd(MCG, false);
  #endif

  // First prepare the external OSC clock.
  #if FSL_FEATURE_MCG_USE_OSCSEL
  CLOCK_HAL_PrepareOsc(MCG, config->oscsel);
  #else
  CLOCK_HAL_PrepareOsc(MCG, kMcgOscselOsc);
  #endif

  // Set to FBE mode.
  CLOCK_HAL_SetClksFrdivIrefs(MCG, kMcgClkOutSrcExternal,
                              config->frdiv,
                              kMcgFllSrcExternal);

  while (kMcgFllSrcExternal != CLOCK_HAL_GetFllSrc(MCG))
  {
  }
  while (kMcgClkOutStatExternal != CLOCK_HAL_GetClkOutStat(MCG))
  {
  }

  // In FBE now, start to enter BLPE.
  CLOCK_HAL_SetLowPowerModeCmd(MCG, true);

  // Set MCGIRCLK.
  if (config->irclkEnable)
  {
    CLOCK_HAL_UpdateInternalRefClk(MCG,
                                   config->ircs,
                                   config->fcrdiv,
                                   config->irclkEnableInStop);
  }

  return kMcgModeErrNone;
}

  #if FSL_FEATURE_MCG_HAS_PLL
/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_SYS_BootToPee
 * Description  : This function is used to set MCG to PEE mode when boot up.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_SYS_BootToPee(const mcg_config_t *config)
{
  mcg_mode_error_t errorCode;

  #if (defined(FSL_FEATURE_MCG_RESET_IS_BLPI) && FSL_FEATURE_MCG_RESET_IS_BLPI)
  /*If reset mode is BLPI, first disable LP to enter FBI mode. */
  CLOCK_HAL_SetLowPowerModeCmd(MCG, false);
  #endif

  #if FSL_FEATURE_MCG_HAS_PLL1
  mcg_pll_clk_select_t pllcs  = config->pllcs;
  #elif !(defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
  mcg_pll_clk_select_t pllcs  = kMcgPllClkSelPll0;
  #endif

   #if FSL_FEATURE_MCG_USE_OSCSEL
  mcg_oscsel_select_t  oscsel = config->oscsel;
  #else
  mcg_oscsel_select_t  oscsel = kMcgOscselOsc;
  #endif

  // First prepare the external OSC clock.
  CLOCK_HAL_PrepareOsc(MCG, oscsel);

  // Set to FBE mode.
  CLOCK_HAL_SetClksFrdivIrefs(MCG, kMcgClkOutSrcExternal,
                              config->frdiv,
                              kMcgFllSrcExternal);

  while (kMcgFllSrcExternal != CLOCK_HAL_GetFllSrc(MCG))
  {
  }
  while (kMcgClkOutStatExternal != CLOCK_HAL_GetClkOutStat(MCG))
  {
  }

  // Set to PBE mode.
  #if FSL_FEATURE_MCG_HAS_PLL1
  if (kMcgPllClkSelPll0 == pllcs)
  {
    errorCode = CLOCK_HAL_SetPbeMode(MCG, oscsel, pllcs, config->prdiv1, config->vdiv1);
  }
  else
  {
    errorCode = CLOCK_HAL_SetPbeMode(MCG, oscsel, pllcs, config->prdiv0, config->vdiv0);
  }
  #else
    #if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
  errorCode = CLOCK_HAL_SetPbeMode(MCG, oscsel, config->pllRef, config->frdiv);
    #else
  errorCode = CLOCK_HAL_SetPbeMode(MCG, oscsel, pllcs, config->prdiv0, config->vdiv0);
    #endif
  #endif

