Indemsys/Multizone-temperature-sensor/KW40_Firmware/Platform/FSL/fsl_clock_manager.c
  // Change to PEE mode.
  if (kMcgModeErrNone == errorCode)
  {
    CLOCK_HAL_SetClkOutSrc(MCG, kMcgClkOutSrcOut);
    while (CLOCK_HAL_GetClkOutStat(MCG) != kMcgClkOutStatPll)
    {
    }

    // Set MCGIRCLK.
    if (config->irclkEnable)
    {
      CLOCK_HAL_UpdateInternalRefClk(MCG,
                                     config->ircs,
                                     config->fcrdiv,
                                     config->irclkEnableInStop);
    }
  }

  return errorCode;
}

    #if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
/*FUNCTION******************************************************************************
 *
 * Functon name : CLOCK_SYS_BootToPei
 * Description  : This function is used to set MCG to PEI mode when boot up.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_SYS_BootToPei(const mcg_config_t *config)
{
  // Set to PBI mode and prepare the PLL.
  CLOCK_HAL_SetPbiMode(MCG, config->ircs, config->fcrdiv);

  // Switch to PEI mode.
  CLOCK_HAL_SetPeiMode(MCG);

  return kMcgModeErrNone;
}
    #endif

  #endif

/* The index definition in mcgModeMatrix. */
  #define MCG_MATRIX_FEI  0U
  #define MCG_MATRIX_FBI  1U
  #define MCG_MATRIX_BLPI 2U
  #define MCG_MATRIX_FEE  3U
  #define MCG_MATRIX_FBE  4U
  #define MCG_MATRIX_BLPE 5U
  #define MCG_MATRIX_PBE  6U
  #define MCG_MATRIX_PEE  7U
  #define MCG_MATRTX_PEI  8U
  #define MCG_MATRTX_PBI  9U

/*
 * The transaction matrix. It defines the path for mode switch, the row is for
 * current mode and the column is target mode.
 * For example, switch from FEI to PEE:
 * 1. Current mode FEI, next mode is mcgModeMatrix[FEI][PEE] = FBE, so swith to FBE.
 * 2. Current mode FBE, next mode is mcgModeMatrix[FBE][PEE] = PBE, so swith to PBE.
 * 3. Current mode PBE, next mode is mcgModeMatrix[PBE][PEE] = PEE, so swith to PEE.
 * Thus the MCG mode has changed from FEI to PEE.
 */
  #if FSL_FEATURE_MCG_HAS_PLL
    #if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
static const uint8_t mcgModeMatrix[10][10] = {
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE, MCG_MATRIX_FBI,  MCG_MATRIX_FBI }, /* FEI */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_BLPI, MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE, MCG_MATRIX_FBI,  MCG_MATRIX_FBI }, /* FBI */
  { MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_BLPI, MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI, MCG_MATRIX_FBI,  MCG_MATRIX_FBI }, /* BLPI */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE, MCG_MATRIX_FBI,  MCG_MATRIX_FBI }, /* FEE */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_BLPE, MCG_MATRIX_PBE,  MCG_MATRIX_PBE, MCG_MATRIX_FBI,  MCG_MATRIX_FBI }, /* FBE */
  { MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_BLPE, MCG_MATRIX_PBE,  MCG_MATRIX_PBE, MCG_MATRIX_FBE,  MCG_MATRIX_FBE }, /* BLPE */
  { MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_BLPE, MCG_MATRIX_PBE,  MCG_MATRIX_PEE, MCG_MATRIX_FBE,  MCG_MATRIX_FBE }, /* PBE */
  { MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE, MCG_MATRIX_PBE,  MCG_MATRIX_PBE }, /* PEE */
  { MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI, MCG_MATRIX_FBI,  MCG_MATRIX_FBI }, /* PEI */
  { MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_BLPI, MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI, MCG_MATRTX_PEI,  MCG_MATRIX_FBI}  /* PBI */
/*      FEI           FBI           BLPI          FEE           FBE           BLPE          PBE           PEE          PEI           PBI       */
};
    #else
static const uint8_t mcgModeMatrix[8][8] = {
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE  }, /* FEI */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_BLPI, MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE  }, /* FBI */
  { MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_BLPI, MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI  }, /* BLPI */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE  }, /* FEE */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_BLPE, MCG_MATRIX_PBE,  MCG_MATRIX_PBE  }, /* FBE */
  { MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_BLPE, MCG_MATRIX_PBE,  MCG_MATRIX_PBE  }, /* BLPE */
  { MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_BLPE, MCG_MATRIX_PBE,  MCG_MATRIX_PEE  }, /* PBE */
  { MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE,  MCG_MATRIX_PBE  }  /* PEE */
/*        FEI              FBI              BLPI             FEE              FBE              BLPE             PBE              PEE       */
};
    #endif
  #else
static const uint8_t mcgModeMatrix[6][6] = {
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE   }, /* FEI */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_BLPI, MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE   }, /* FBI */
  { MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_BLPI, MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI   }, /* BLPI */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE   }, /* FEE */
  { MCG_MATRIX_FEI,  MCG_MATRIX_FBI,  MCG_MATRIX_FBI,  MCG_MATRIX_FEE,  MCG_MATRIX_FBE,  MCG_MATRIX_BLPE  }, /* FBE */
  { MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_FBE,  MCG_MATRIX_BLPE  }, /* BLPE */
/*        FEI              FBI              BLPI             FEE              FBE              BLPE      */
};
  #endif

