Indemsys/Multizone-temperature-sensor/KW40_Firmware/Platform/FSL/fsl_clock_manager.c
/*FUNCTION******************************************************************************
 *
 * Function name : CLOCK_SYS_McgModeToIdx
 * Description  : This function transfers the mcg_modes_t to the index of MCG matrix index.
 *
 *END***********************************************************************************/
static uint8_t CLOCK_SYS_McgModeToIdx(mcg_modes_t mode)
{
  uint8_t idx = 0U;
  assert(mode < kMcgModeSTOP);

  while (!(((uint32_t)mode) & (1U << idx)))
  {
    idx++;
  }

  return idx;
}

/*FUNCTION******************************************************************************
 *
 * Function name : CLOCK_SYS_SetMcgMode
 * Description  : This function sets MCG to some target mode defined by the configure
 * structure, if can not switch to target mode directly, this function will choose
 * the proper path. If external clock is used in the target mode, please make sure
 * it is enabled, for example, if the external oscillator is used, please setup EREFS/HGO
 * correctly and make sure OSCINIT is set.
 *
 *END***********************************************************************************/
mcg_mode_error_t CLOCK_SYS_SetMcgMode(mcg_config_t const *targetConfig)
{
  uint8_t              matrixIdx,
                       matrixIdxTarget;

  #if FSL_FEATURE_MCG_USE_OSCSEL
  mcg_oscsel_select_t  oscsel          = targetConfig->oscsel;
  #else
  mcg_oscsel_select_t  oscsel          = kMcgOscselOsc;
  #endif
            #if FSL_FEATURE_MCG_HAS_PLL
              #if (FSL_FEATURE_MCG_HAS_PLL1 || FSL_FEATURE_MCG_HAS_EXTERNAL_PLL)
  mcg_pll_clk_select_t pllcs           = targetConfig->pllcs;
    #elif !(defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
  mcg_pll_clk_select_t pllcs           = kMcgPllClkSelPll0;
    #endif
  #endif

  matrixIdx       = CLOCK_SYS_McgModeToIdx(CLOCK_HAL_GetMcgMode(MCG));
  matrixIdxTarget = CLOCK_SYS_McgModeToIdx(targetConfig->mcg_mode);

  do
  {
    matrixIdx = mcgModeMatrix[matrixIdx][matrixIdxTarget];

    switch (matrixIdx)
    {
    case MCG_MATRIX_FEI:
      CLOCK_HAL_SetFeiMode(MCG, targetConfig->drs, CLOCK_SYS_FllStableDelay);
      break;
    case MCG_MATRIX_FEE:
      CLOCK_HAL_SetFeeMode(MCG, oscsel, targetConfig->frdiv, targetConfig->dmx32, targetConfig->drs, CLOCK_SYS_FllStableDelay);
      break;
    case MCG_MATRIX_FBI:
      CLOCK_HAL_SetFbiMode(MCG, targetConfig->drs, targetConfig->ircs, targetConfig->fcrdiv, NULL);
      break;
    case MCG_MATRIX_FBE:
      CLOCK_HAL_SetFbeMode(MCG, oscsel, targetConfig->frdiv, targetConfig->dmx32, targetConfig->drs, NULL);
      break;
    case MCG_MATRIX_BLPI:
      CLOCK_HAL_SetBlpiMode(MCG, targetConfig->fcrdiv, targetConfig->ircs);
      break;
    case MCG_MATRIX_BLPE:
      CLOCK_HAL_SetBlpeMode(MCG, oscsel);
      break;
      #if FSL_FEATURE_MCG_HAS_PLL
    case MCG_MATRIX_PBE:
        #if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
      CLOCK_HAL_SetPbeMode(MCG, oscsel, targetConfig->pllRef, targetConfig->frdiv);
        #else
      // If target mode is not PBE or PEE, then only need to set CLKS = EXT here.
      if ((MCG_MATRIX_PEE == matrixIdxTarget) || (MCG_MATRIX_PBE == matrixIdxTarget))
      {
            #if FSL_FEATURE_MCG_HAS_PLL1
        if (kMcgPllClkSelPll0 == pllcs)
        {
          CLOCK_HAL_SetPbeMode(MCG, oscsel, pllcs, targetConfig->prdiv0, targetConfig->vdiv0);
        }
        else
        {
          CLOCK_HAL_SetPbeMode(MCG, oscsel, pllcs, targetConfig->prdiv1, targetConfig->vdiv1);
        }
            #else
        CLOCK_HAL_SetPbeMode(MCG, oscsel, pllcs, targetConfig->prdiv0, targetConfig->vdiv0);
            #endif
      }
      else
      {
        CLOCK_HAL_SetClkOutSrc(MCG, kMcgClkOutSrcExternal);
        while (CLOCK_HAL_GetClkOutStat(MCG) != kMcgClkOutStatExternal)
        {
        }
      }
        #endif //FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE
      break;
    case MCG_MATRIX_PEE:
      CLOCK_HAL_SetPeeMode(MCG);
      break;
        #if (defined(FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE) && FSL_FEATURE_MCG_HAS_PLL_INTERNAL_MODE)
    case MCG_MATRTX_PBI:
      CLOCK_HAL_SetPbiMode(MCG, targetConfig->ircs, targetConfig->fcrdiv);
      break;
    case MCG_MATRTX_PEI:
      CLOCK_HAL_SetPeiMode(MCG);
      break;
        #endif
      #endif
    default:
      break;
    }
  }
  while (matrixIdx != matrixIdxTarget);

  /* Enable MCGIRCLK. */
  CLOCK_HAL_SetInternalRefClkEnableCmd(MCG, targetConfig->irclkEnable);
  CLOCK_HAL_SetInternalRefClkEnableInStopCmd(MCG, targetConfig->irclkEnableInStop);

  /* Configure MCGIRCLK. */
  if (targetConfig->irclkEnable)
  {
    if (kMcgIrcFast == targetConfig->ircs)
    {
      /* Update FCRDIV if necessary. */
      CLOCK_HAL_UpdateFastClkInternalRefDiv(MCG, targetConfig->fcrdiv);
    }

    CLOCK_HAL_SetInternalRefClkMode(MCG, targetConfig->ircs);
    while (targetConfig->ircs != CLOCK_HAL_GetInternalRefClkMode(MCG))
    {
    }
  }

  #if FSL_FEATURE_MCG_HAS_PLL
  /* Enable PLL0. */
  if (targetConfig->pll0EnableInFllMode)
  {
      #if (FSL_FEATURE_MCG_HAS_PLL_PRDIV && FSL_FEATURE_MCG_HAS_PLL_VDIV)
    CLOCK_HAL_EnablePll0InFllMode(MCG, targetConfig->prdiv0, targetConfig->vdiv0, targetConfig->pll0EnableInStop);
      #else
    CLOCK_HAL_EnablePll0InFllMode(MCG, targetConfig->pll0EnableInFllMode);
      #endif
  }
  else
  {
    CLOCK_HAL_SetPll0EnableCmd(MCG, false);
  }
  #endif

  return kMcgModeErrNone;
}

#endif

#if (defined(FSL_FEATURE_SOC_SCG_COUNT) && FSL_FEATURE_SOC_SCG_COUNT) // USE_SCG

#else

  #if FSL_FEATURE_SOC_MCGLITE_COUNT

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_OscInit
 * Description   : Initialize OSC.
 *
 * This function initializes OSC according to configuration.
 *
 *END**************************************************************************/
clock_manager_error_code_t CLOCK_SYS_OscInit(uint32_t instance,
                                             osc_user_config_t *config)
{
  assert(instance < OSC_INSTANCE_COUNT);
  uint32_t capacitorMask = 0U;

