Indemsys/Multizone-temperature-sensor/KW40_Firmware/Platform/FSL/fsl_clock_manager.c
  if (kOscSrcOsc == config->erefs) /* oscillator is used. */
  {
    capacitorMask = (config->enableCapacitor2p   ? kOscCapacitor2p   : 0U) |
                    (config->enableCapacitor4p   ? kOscCapacitor4p   : 0U) |
                    (config->enableCapacitor8p   ? kOscCapacitor8p   : 0U) |
                    (config->enableCapacitor16p  ? kOscCapacitor16p  : 0U);
    OSC_HAL_SetCapacitor(g_oscBase[instance], capacitorMask);
  }

  #if FSL_FEATURE_MCGLITE_HAS_RANGE0
  CLOCK_HAL_SetRange0Mode(MCG, config->range);
  #endif
  #if FSL_FEATURE_MCGLITE_HAS_HGO0
  CLOCK_HAL_SetHighGainOsc0Mode(MCG, config->hgo);
  #endif
  CLOCK_HAL_SetExtRefSelMode0(MCG, config->erefs);

  CLOCK_SYS_SetOscerConfigration(instance, &(config->oscerConfig));

  /* oscillator is used. */
  if ((kOscSrcOsc == config->erefs) &&
      (true == config->oscerConfig.enable))
  {
    while (!CLOCK_HAL_IsOscStable(MCG))
    {
    }
  }

  g_xtal0ClkFreq = config->freq;

  return kClockManagerSuccess;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_OscDeinit
 * Description   : Deinitialize OSC.
 *
 *END**************************************************************************/
void CLOCK_SYS_OscDeinit(uint32_t instance)
{
  assert(instance < OSC_INSTANCE_COUNT);

  OSC_HAL_SetExternalRefClkInStopModeCmd(g_oscBase[instance], false);
  OSC_HAL_SetExternalRefClkCmd(g_oscBase[instance], false);
  CLOCK_HAL_SetExtRefSelMode0(MCG, kOscSrcExt);
  #if FSL_FEATURE_MCGLITE_HAS_RANGE0
  CLOCK_HAL_SetRange0Mode(MCG, kOscRangeLow);
  #endif
  #if FSL_FEATURE_MCGLITE_HAS_HGO0
  CLOCK_HAL_SetHighGainOsc0Mode(MCG, kOscGainLow);
  #endif

  g_xtal0ClkFreq = 0U;
}

  #else // Use MCG

    #if FSL_FEATURE_SOC_OSC_COUNT

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_OscInit
 * Description   : Initialize OSC.
 *
 * This function initializes OSC according to configuration.
 *
 *END**************************************************************************/
clock_manager_error_code_t CLOCK_SYS_OscInit(uint32_t instance,
                                             osc_user_config_t *config)
{
  assert(instance < OSC_INSTANCE_COUNT);
  uint32_t capacitorMask = 0U;

  if (kOscSrcOsc == config->erefs) /* oscillator is used. */
  {
    capacitorMask = (config->enableCapacitor2p   ? kOscCapacitor2p   : 0U) |
                    (config->enableCapacitor4p   ? kOscCapacitor4p   : 0U) |
                    (config->enableCapacitor8p   ? kOscCapacitor8p   : 0U) |
                    (config->enableCapacitor16p  ? kOscCapacitor16p  : 0U);
    OSC_HAL_SetCapacitor(g_oscBase[instance], capacitorMask);
  }

  CLOCK_SYS_SetOscerConfigration(instance, &(config->oscerConfig));

  #if (defined(FSL_FEATURE_MCG_HAS_OSC1) && (1U == FSL_FEATURE_MCG_HAS_OSC1))
  if (0U == instance)
  {
  #endif
    CLOCK_HAL_SetOsc0Mode(MCG, config->range, config->hgo, config->erefs);

    /* oscillator is used. */
    if ((kOscSrcOsc == config->erefs) &&
        (true == config->oscerConfig.enable))
    {
      while (!CLOCK_HAL_IsOsc0Stable(MCG))
      {
      }
    }
    g_xtal0ClkFreq = config->freq;
    #if (defined(FSL_FEATURE_MCG_HAS_OSC1) && (1U == FSL_FEATURE_MCG_HAS_OSC1))
  }
  else
  {
    CLOCK_HAL_SetOsc1Mode(MCG, config->range, config->hgo, config->erefs);

    /* oscillator is used. */
    if ((kOscSrcOsc == config->erefs) &&
        (true == config->oscerConfig.enable))
    {
      while (!CLOCK_HAL_IsOsc1Stable(MCG))
      {
      }
    }
    g_xtal1ClkFreq = config->freq;
  }
    #endif

  return kClockManagerSuccess;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_OscDeinit
 * Description   : Deinitialize OSC.
 *
 *END**************************************************************************/
void CLOCK_SYS_OscDeinit(uint32_t instance)
{
  assert(instance < OSC_INSTANCE_COUNT);
  OSC_HAL_SetExternalRefClkInStopModeCmd(g_oscBase[instance], false);
  OSC_HAL_SetExternalRefClkCmd(g_oscBase[instance], false);

  #if (defined(FSL_FEATURE_MCG_HAS_OSC1) && (1U == FSL_FEATURE_MCG_HAS_OSC1))
  if (0U == instance)
  {
  #endif
    CLOCK_HAL_SetOsc0Mode(MCG,
                          kOscRangeLow,
                          kOscGainLow,
                          kOscSrcExt);
    g_xtal0ClkFreq = 0U;
    #if (defined(FSL_FEATURE_MCG_HAS_OSC1) && (1U == FSL_FEATURE_MCG_HAS_OSC1))
  }
  else
  {
    CLOCK_HAL_SetOsc1Mode(MCG,
                          kOscRangeLow,
                          kOscGainLow,
                          kOscSrcExt);
    g_xtal1ClkFreq = 0U;
  }
    #endif
}

    #endif

  #endif

  #if FSL_FEATURE_SOC_OSC_COUNT
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_SetOscerConfigration
 * Description   : This funtion sets the OSCERCLK for clock transition.
 *
 *END**************************************************************************/
void CLOCK_SYS_SetOscerConfigration(uint32_t instance, oscer_config_t const *config)
{
  #if FSL_FEATURE_OSC_HAS_EXT_REF_CLOCK_DIVIDER
  OSC_HAL_SetExternalRefClkDiv(g_oscBase[instance],
                               config->erclkDiv);
  #endif

  #if FSL_FEATURE_SOC_OSC_COUNT
  OSC_HAL_SetExternalRefClkCmd(g_oscBase[instance],
                               config->enable);

  OSC_HAL_SetExternalRefClkInStopModeCmd(g_oscBase[instance],
                                         config->enableInStop);
  #endif

}
  #endif
#endif

#if defined(FSL_FEATURE_SOC_RTC_COUNT) && (FSL_FEATURE_SOC_RTC_COUNT)
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_RtcOscInit
 * Description   : This funtion initializes the RTC OSC.
 *
 *END**************************************************************************/
clock_manager_error_code_t CLOCK_SYS_RtcOscInit(uint32_t instance,
                                                rtc_osc_user_config_t *config)
{
  assert(instance < RTC_INSTANCE_COUNT);

