Indemsys/Multizone-temperature-sensor/KW40_Firmware/Platform/FSL/fsl_clock_manager.c
  CLOCK_SYS_EnableRtcClock(instance);
  g_xtalRtcClkFreq = config->freq;

  #if defined(FSL_FEATURE_RTC_IS_IRTC) && (FSL_FEATURE_RTC_IS_IRTC)
  uint16_t rtcGpDataRagVal = 0; // RTC_GP_DATA_REG register value.

  rtcGpDataRagVal = RTC_RD_GP_DATA_REG(RTC);

  // If the oscillator is not enabled and should be enabled.
  if (((rtcGpDataRagVal & IRTC_OSC_ENABLE_MASK)) && (config->enableOsc))
  {
    rtcGpDataRagVal &= ~(IRTC_OSC_SC2P_MASK |
                         IRTC_OSC_SC4P_MASK |
                         IRTC_OSC_SC8P_MASK |
                         IRTC_OSC_SC16P_MASK);

    if (config->enableCapacitor2p)
    {
      rtcGpDataRagVal |= IRTC_OSC_SC2P_MASK;
    }
    if (config->enableCapacitor4p)
    {
      rtcGpDataRagVal |= IRTC_OSC_SC4P_MASK;
    }
    if (config->enableCapacitor8p)
    {
      rtcGpDataRagVal |= IRTC_OSC_SC8P_MASK;
    }
    if (config->enableCapacitor16p)
    {
      rtcGpDataRagVal |= IRTC_OSC_SC16P_MASK;
    }
    rtcGpDataRagVal &= (~IRTC_OSC_ENABLE_MASK);
  }
  else if (!(config->enableOsc))
  {
    rtcGpDataRagVal |= IRTC_OSC_ENABLE_MASK;
  }

  while (IRTC_HAL_GetStatusFlag(RTC, kIRTCReadOnly))
  {
    IRTC_HAL_SetLockRegisterCmd(RTC, false);
  }

  RTC_WR_GP_DATA_REG(RTC, rtcGpDataRagVal);

  #else
  // If the oscillator is not enabled and should be enabled.
  if ((!RTC_HAL_IsOscillatorEnabled(RTC)) && (config->enableOsc))
  {
    RTC_HAL_SetOsc2pfLoadCmd(RTC, config->enableCapacitor2p);
    RTC_HAL_SetOsc4pfLoadCmd(RTC, config->enableCapacitor4p);
    RTC_HAL_SetOsc8pfLoadCmd(RTC, config->enableCapacitor8p);
    RTC_HAL_SetOsc16pfLoadCmd(RTC, config->enableCapacitor16p);
  }
  RTC_HAL_SetOscillatorCmd(RTC, config->enableOsc);
  #endif

  return kClockManagerSuccess;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_RtcOscDeinit
 * Description   : This funtion de-initializes the RTC OSC.
 *
 *END**************************************************************************/
void CLOCK_SYS_RtcOscDeinit(uint32_t instance)
{
  assert(instance < RTC_INSTANCE_COUNT);

  g_xtalRtcClkFreq = 0U;

  #if defined(FSL_FEATURE_RTC_IS_IRTC) && (FSL_FEATURE_RTC_IS_IRTC)
  while (IRTC_HAL_GetStatusFlag(RTC, kIRTCReadOnly))
  {
    IRTC_HAL_SetLockRegisterCmd(RTC, false);
  }

  RTC_SET_GP_DATA_REG(RTC, 1U);
  #else
  RTC_HAL_SetOscillatorCmd(RTC, false);
  #endif
}
#endif

/*******************************************************************************
 * EOF
 ******************************************************************************/

